let cookie;
const total_cause = ['지구', '온실', '해수면', '온실가스', '북극', '온난화', '기후변화', '도시', '사태', '생태계', '이산화탄소'];

const causes_id = {
    '지구': 'earth',
    '온실': 'greenhouse',
    '해수면': 'sea​Level',
    '온실가스': 'greenGas',
    '북극': 'northPole',
    '온난화': 'warming',
    '기후변화': 'weatherChange',
    '도시': 'city',
    '사태': 'situation',
    '생태계': 'ecosystem',
    '이산화탄소': 'carbonDioxide'
};
const causes_name = {
    'earth': '지구',
    'greenhouse': '온실',
    'sea​Level': '해수면',
    'greenGas': '온실가스',
    'northPole': '북극',
    'warming': '온난화',
    'weatherChange': '기후변화',
    'city': '도시',
    'situation': '사태',
    'ecosystem': '생태계',
    'carbonDioxide': '이산화탄소'
};
const causes_explain = {
    'earth': '지구(地球) 또는 어스(영어: Earth)는 태양으로부터 세 번째 행성이며,<br>얇은 대기층으로 둘러싸여 있고,<br>지금까지 발견된 지구형 행성 가운데 가장 크다.<br>지구는 45억 6700만 년 전 형성되었으며,<br>용암 활동이 활발했던 지구와 행성 테이아의<br>격렬한 충돌로 생성되었을 달을 위성으로 둔다.<br>지구의 중력은 우주의 다른 물체,<br>특히 태양과 지구의 유일한 자연위성인 달과 상호작용한다.<br>지구와 달 사이의 중력 작용으로 조석 현상이 발생한다.<br>지구 온난화는 지구의 평균 기온이 상승하는 현상을 말한다.<br>산업화 이후, 인류의 과도한 화석 연료 사용으로 인해<br>추가적으로 발생한 온실 기체가 원인이라는 설이 가장 유력하다.<br>지구온난화의 예는 1880년대의 -19mm였던 해수면이 1930년 제1회 월드컵 때는 3mm로,<br>지금은 37mm로 높아져서 지구 온난화로 인해 사라진 섬들이 많다.<br>최근에는 이런 온난화를 막기 위해 노력하고 있는데,<br>이를테면 선진국에서 개발한 도심 속의 숲, 전기자동차, 한국에서 개발한 승용차 요일제 등이 있다.',
    'northPole': '북극(영어: Arctic, 北極)은 지구 북극점 근처의 지역이다.<br>북극점을 "북극"으로 부르기도 한다.<br>북극은 북극해뿐만 아니라 러시아,<br>시베리아(러시아), 알래스카(미국), 캐나다, 그린란드,<br>아이슬란드, 스칸디나비아(노르웨이, 스웨덴, 핀란드)를 포함한다.<br>남극과 마찬가지로 북극에도 대한민국을 포함한<br>여러 나라가 연구 기지를 설치하였다.<br>북극 지방은 여러가지 정의가 있다.<br>여름에 해가 지지 않고 겨울에 해가<br>뜨지 않는 북위 66° 33’의 북극권 북쪽 지방으로<br>정의하거나 기후와 식생을 기준으로<br>여름철 기온이 10 °C를 넘지 않는 선을 기준으로 하기도 한다.<br>이 기준은 대략 수목한계선과 일치한다.<br>북극 빙하의 감소 원인이 지구 온난화라 규정되었다.<br>이는 최근 몇 년 간의<br>유빙(流氷)의 융해(融解)로 보다 명백해졌다.<br>기후 모형은 북극에서는 전지구 평균보다<br>큰 온난화가 있을 것을 예견하였다.<br>2011년에 처음으로 오존홀이 발견 되기도 하였다.<br>인류는 이미 지구 가장 위에 떠있는 빙하의 3/4을 잃었다.',
    'seaLevel': '해수면 상승(海水面 上昇, Sea level rise)은 해수면이 상승하는 현상을 말한다.<br>원인으로 지구 온난화의 영향에 따른<br>해수의 열팽창과 대륙 빙하의 융해 등이 있다.<br>해수면 상승으로 인하여<br>방글라데시 등의 저지대 국가와<br>뉴욕, 마이애미, 암스테르담과 같은 저지대 도시와<br>몰디브, 투발루, 키리바시와 같은 해발고도가 낮은 작은 섬들이<br>수몰될 위기에 처해있다.<br>호주 기후위원회가 최근 발표한 보고서에 따르면,<br>호주 서부는 현재 해수면 상승속도가<br>전 세계 평균수준의 2배 가량으로 21 세기<br>말 경에는 호주의 서남부 지역 도시의<br>2만8900세대가 침몰 위기에 직면하게 될 것으로 예상된다.<br>남태평양의 작은 섬나라 키리바시는 해수면 상승,<br>기후변화로 인해 생존을 위협받고 있다.<br>이런 이유로 아노테 통(Anote Tong) 키리바시 대통령은<br>2015년 8월 13일 전 세계 지도자들에게<br>신규 석탄 채굴 및 광산 개발 확대를<br>즉각적으로 중단해 줄 것을 호소했다.<br>실제로 키리바시와 같은 섬 나라는<br>매년 1.2cm의 해수면상승이 관측되며,<br>이로 인한 직접적 피해를 이미 받고 있다.',
    'greenGas': '온실가스 또는 온실 기체(溫室氣體, 영어: greenhouse gases, GHGs)는<br>지구의 지표면에서 우주로 발산하는<br>적외선 복사열을 흡수 또는 반사하여<br>지구 표면의 온도를 상승시키는 역할을 하는<br>특정 기체를 말하는데<br>두가지 이상의 서로 다른 원자가 결합된<br>모든 기체가 이에 해당한다.<br>다만 일산화탄소(CO), 염화수소(HCl)등은<br>두개의 상이한 원자로 결합된 분자이지만<br>대기에서의 잔류 수명이 매우 짧아<br>온실효과에 거의 영향을 주지않는<br>기체이므로 온실가스로 다루지 않는다.',
    'northPole': '북극(영어: Arctic, 北極)은 지구 북극점 근처의 지역이다.<br>북극점을 "북극"으로 부르기도 한다.<br>북극은 북극해뿐만 아니라 러시아,<br>시베리아(러시아), 알래스카(미국), 캐나다,<br>그린란드, 아이슬란드, 스칸디나비아(노르웨이,<br>스웨덴, 핀란드)를 포함한다.<br>남극과 마찬가지로 북극에도 대한민국을 포함한<br>여러 나라가 연구 기지를 설치하였다.<br>북극 지방은 여러가지 정의가 있다.<br>여름에 해가 지지 않고 겨울에<br>해가 뜨지 않는 북위 66° 33’의 북극권<br>북쪽 지방으로 정의하거나 기후와<br>식생을 기준으로 여름철 기온이 10 °C를 넘지 않는 선을 기준으로 하기도 한다.<br>이 기준은 대략 수목한계선과 일치한다.<br>북극 빙하의 감소 원인이 지구 온난화라 규정되었다.<br>이는 최근 몇 년 간의 유빙(流氷)의 융해(融解)로 보다 명백해졌다.<br>기후 모형은 북극에서는 전지구 평균보다 큰 온난화가<br>있을 것을 예견하였다.<br>2011년에 처음으로 오존홀이 발견 되기도 하였다.<br>인류는 이미 지구 가장 위에 떠있는 빙하의 3/4을 잃었다.',
    'warming': '지구 온난화(地球溫暖化, 영어: global warming)는 19세기 후반부터 시작된 전 세계적인 바다와 지표 부근 공기의 기온 상승을 의미한다. 21세기 초부터 2018년까지 지구 표면의 평균 온도는 1980년에 비해 약 3분의 2가 넘는 0.93 ± 0.07 °C 정도 기온이 상승했다. 기후 온난화의 원인에 대해서는 아직 애매하나, 대부분의 과학자들은 90% 이상의 온실 기체 농도의 증가와 화석 연료의 사용과 같은 인간의 활동에 의해 발생한 것으로 추측하고 이러한 연구 결과는 모든 주요 산업 국가의 과학 연구 센터에서 인정받고 있다.기후 모델의 예측은 기후 변화에 관한 환경적 패널(IPCC) 에서 2007년 발표된 IPCC 제 4차 평가 보고서에서 요약되었다. 이 보고서에서는, 21세기 동안 지구의 평균 온도는 최하 1.1 - 2.9 °C 상승에서 최대 2.4 - 6.4 °C 까지 상승할 수 있다고 예고했다. 이러한 예상 수치의 오차는 모델마다 서로 다른 기후 민감도 때문에 발생한다.제4차 보고서에 따르면, 전 세계의 온난화로 인해 지역적 영향이 발생한다고 발표했다. 지구 온난화의 영향으로 지구 기온이 증가함과 함께 해수면 상승 및 강수량과 패턴의 변화, 아열대 사막 지방의 확장 등이 있다. 또한, 지구 온난화로 북극의 축소와 지속적인 빙하, 영구 동토층, 해빙의 감소 등이 나타난다. 지구 온난화의 다른 영향으로는 극한 기후와 폭염의 증가, 가뭄과 폭우, 해양 산성화와 종의 멸종도 있다. 인간 생활에서는 농업 수확량의 감소와 기후변화 난민의 발생이 있다.지구 온난화로 인해 제안된 정책들에서는 탄소 배출 감소로 온난화를 완화시키고 지구공학을 통해 적응하는 것이다. 대부분의 국가들이 모인 기후 변화에 관한 국제 연합 기본 협약(UNFCCC)에서는 궁극적인 목표로 인간에 의한 위험 기후 변화의 방지를 목적으로 하고 있다. UNFCCC의 가입국들은 온실 기체를 줄이기 위한 정책을 채택했으며, 지구 온난화의 적응을 지원하고 있다. UNFCCC 참여국들은 탄소 배출량의 큰 감소 필요성에 동의하며 미래의 지구 온난화에 대하여 2.0 °C 내외로 국한해야 한다. 2011년 국제 연합 환경 계획의 보고서와 국제 에너지 기구에 따르면, 21세기 현재 UNFCCC의 2 °C 감소 목표는 불충분할 수 있으며 좀 더 큰 노력이 필요하다고 발표했다.',
    'weatherChange': '**기후 변화**(氣候 變化, 영어: climate change)는 범지구적, 세계적 규모의 기후 시스템(climate system) 또는 지역적 기후가 시간의 흐름에 따라 최소 수십 년 이상 동안 점진적으로 변화하는 것이다. 10년에서부터 수백만 년의 기간 동안의 대기의 평균적인 상태가 **새로운 기후 패턴**(new weather patterns)으로 변화하는것을 의미하는데, 이러한 변동은 지구 내부의 작용이나 외부의 힘(예를 들면, 태양 복사의 변화)에 의한 것일 수도 있고, 인간의 활동에 의한 것일 수도 있다."기후 변화"의 최근 사용례는, 특히 정치적인 문장에서 종종 근·현대 기후의 변화를 가리킨다. 이와 같은 기후 변화의 원인은 잘 알려지지는 않았으나 여러 가지의 학설이 있다. 그 주된 것으로는 다음과 같다.<br>1. 태양 활동이 변하기 때문이라는 설<br>2. 화산 폭발의 재가 태양 복사를 산란시키기 때문이라는 설<br>3. 오존이나 탄산가스의 양이 변하고 대기의 복사를 변화시키기 때문이라는 설<br>4. 조산운동(造山運動)에 의한 해륙 분포의 변화, 식물 분포의 변화설<br>5. 해양이나 지각의 변화설<br>기후 변화는 지구 기후 내부의 변화와 해양, 만년설 등의 지구의 다른 부분의 진행, 인간 활동의 효과를 반영한다. 기후를 변화시킬 수 있는 외부 요인으로는 태양 복사, 지구의 궤도, 온실 가스 등이 주로 언급된다.',
    'city': '도시에서 나타날 수 있는 환경 문제는 크게 다음과 같이 분류할 수 있다.<br>대기오염 : 자동차의 배기가스와 공장에서 나오는 매연 등으로 인해 공기가 오염될 수 있다.<br>수질오염 : 가정에서 나오는 생활 하수와 공장에서 나오는 폐수 등으로 인해 물이 오염될 수 있다.<br>토양오염 : 가정에서 나오는 새왈 쓰레기와 공장에서 나오는 폐기물 등으로 인해 토양이 오염될 수 있다.',
    'situation': '',
    'ecosystem': '생태계(生態系, 영어: ecosystem)는 상호작용하는 유기체들과 또 그들과 서로 영향을 주고받는 주변의 무생물 환경을 묶어서 부르는 말이다. 생태계를 연구하는 학문을 생태학(ecology)이라고 한다.같은 곳에 살면서 서로 의존하는 유기체 집단이 완전히 독립된 체계를 이루면 이를 "생태계"라고 부를 수 있다. 이 말은 곧 상호의존성과 완결성이 하나의 생태계를 이루는 데 꼭 필요한 요소라는 뜻이다.하나의 생태계 안에 사는 유기체들은 먹이사슬을 통해 서로 밀접하게 연관된 경우가 많다. 이 먹이사슬을 통해 영양물질이 여러 유기체에 걸쳐 순환하고 에너지도 같이 이동하는데, 이런 과정을 거치는 동안 다양한 생태계가 생겨난다.',
    'carbonDioxide': ''
};


function request(method, url, data=null) {
    let xhr = new XMLHttpRequest();
    xhr.open(method, url);
    xhr.setRequestHeader('Content-Type', 'application/json');
    if(data) xhr.send(JSON.stringify(data));
    else xhr.send();
    return xhr;
}
window.onload = () => {
    let uuid = new DeviceUUID().get();
    let xhr = request('POST', '/setCookie', {uid: uuid});
    xhr.onreadystatechange = () => {
        if(xhr.readyState === 4 && xhr.status === 200) {
            let xhr1 = request('POST', '/get_cookie');
            xhr1.onreadystatechange = () => {
                if(xhr1.readyState === 4 && xhr1.status === 200) {
                    cookie = JSON.parse(JSON.parse(xhr1.responseText).cookie.cause_data);
                } else if(xhr1.readyState === 4 && xhr1.status === 400) {
                    location.replace(location.href);
                }
            }
        } else if(xhr.readyState === 4 && xhr.status === 400) {
            let data = JSON.parse(xhr.responseText);
            alert(`쿠키 오류가 발생하였습니다.\n${data.msg}`);
        }
    }

    let causeExplain = document.querySelector(".causeExplain");
    causeExplain.style.height = window.innerHeight - window.innerHeight * 0.15 - 100 + "px";
}

function alert(msg) {
    let alert_div = document.getElementById("alert");
}